gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c

//南网终端Uart管理
#include "../Hcsg/ProjectCSG.h"
#include "../QCSG_Head/QCSG_UpLinkProtocol.h"
#include "../QCSG_Head/QCSG_LocalLinkProtocol.h"
#include "../QCSG_Head/QCSG_DLT645_Protocol.h"
#include "../QCSG_Uart/UartAuto_645.h"

#include "../QCSG_Head/Chint_Type.h"
#include "../QCSG_Head/QCSG_PublicDefine.h"
#include "../QCSG_Head/QCSG_PublicFunc.h"
#include "../QCSG_Head/QCSG_Table.h"
#include "../QCSG_Head/QCSG_Resolve.h"
#include "../QCSG_Data/QCSG_DefaultData.h"

#include "../STM32F4xx/STM32F4xx_IO.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../Device/MEMRW.h"
#include "../Calculate/Calculate.h"
#include "../Display/Warning.h"
#include "../LIB/Ethernet.h"


#include "../QCSG_Uart/TerminalQCSG_Uart_Manage.h"
#include "../QCSG_Head/CH_AMR_TaskManage.h"
#include "../QCSG_Head/CH_PLC_AMR_Task.h" 
#include "../QCSG_Head/CH_RS485_AMR_Task.h" 
#include "../GPRS/GPRS_QCSG.h"
#include "../GPRS/ATNo.h"
#include "../GPRS/ATString.h"
#include "Terminal_Task.h"
#include "../TEST/LOG.h"

//2018.3.26 修改，修正485为抄表口时无法刷新.FUNCTION=1的问题
void Refresh485PortFunction(u32 PORTn, RS485PortParaStruct* PortPara)
{
	u8 Temp[4];
	u32 BpsCtrl;
	UARTCtrl_TypeDef * UARTCtrl;

	BpsCtrl = ConvertToBpsCtrl(PortPara->BaudRate, PortPara->Parity, PortPara->DataBit, PortPara->StopBit);
	switch((u8)PORTn)
	{
		case RS485_1PORT:
			UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
			MR((u32)Temp, ADDR_UART_PORT_SET + 4, 2);
			if(PortPara->Function == UART_FUNC_AMR)
			{
				if(Temp[0] == UART_FUNC_MAINTAIN)
				{
					Temp[0] = UART_FUNC_UNKNOWN;
					Temp[1] = (BpsCtrl >> 5) & 0x0F;
					MW((u32)Temp, ADDR_UART_PORT_SET + 4, 2);
				}	
				UARTCtrl->Function = 1;
			}
			else //if(PortPara->Function == UART_FUNC_UPLINK)
			{
				if(Temp[0] != UART_FUNC_MAINTAIN)
				{
					Temp[0] = UART_FUNC_MAINTAIN;
					Temp[1] = (BpsCtrl >> 5) & 0x0F;
					MW((u32)Temp, ADDR_UART_PORT_SET + 4, 2);
				}
				UARTCtrl->Function = UART_FUNC_MAINTAIN;
				if(UARTCtrl->BpsCtrl != BpsCtrl)
				{
					UARTCtrl->BpsCtrl = BpsCtrl;
					Init_UARTn(RS485_1PORT);
				}
			}
			break;
		case RS485_2PORT:
			UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
			MR((u32)Temp, ADDR_UART_PORT_SET + 8, 2);
			if(PortPara->Function == UART_FUNC_AMR)
			{
				if(Temp[0] == UART_FUNC_MAINTAIN)
				{
					Temp[0] = UART_FUNC_UNKNOWN;
					Temp[1] = (BpsCtrl >> 5) & 0x0F;
					MW((u32)Temp, ADDR_UART_PORT_SET + 8, 2);
				}	
				UARTCtrl->Function = 1;
			}
			else //if(PortPara->Function == UART_FUNC_UPLINK)
			{
				if(Temp[0] != UART_FUNC_MAINTAIN)
				{
					Temp[0] = UART_FUNC_MAINTAIN;
					Temp[1] = (BpsCtrl >> 5) & 0x0F;
					MW((u32)Temp, ADDR_UART_PORT_SET + 8, 2);
				}
				UARTCtrl->Function = UART_FUNC_MAINTAIN;
				if(UARTCtrl->BpsCtrl != BpsCtrl)
				{
					UARTCtrl->BpsCtrl = BpsCtrl;
					Init_UARTn(RS485_2PORT);
				}
			}
			break;
		case RS485_3PORT:
			UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_3PORT);
			MR((u32)Temp, ADDR_UART_PORT_SET + 12, 2);
			if(PortPara->Function == UART_FUNC_AMR)
			{
				if(Temp[0] == UART_FUNC_MAINTAIN)
				{
					Temp[0] = UART_FUNC_UNKNOWN;
					Temp[1] = (BpsCtrl >> 5) & 0x0F;
					MW((u32)Temp, ADDR_UART_PORT_SET + 12, 2);
				}	
				UARTCtrl->Function = 1;
			}
			else //if(PortPara->Function == UART_FUNC_UPLINK)
			{
				if(Temp[0] != UART_FUNC_MAINTAIN)
				{
					Temp[0] = UART_FUNC_MAINTAIN;
					Temp[1] = (BpsCtrl >> 5) & 0x0F;
					MW((u32)Temp, ADDR_UART_PORT_SET + 12, 2);
				}
				UARTCtrl->Function = UART_FUNC_MAINTAIN;
				if(UARTCtrl->BpsCtrl != BpsCtrl)
				{
					UARTCtrl->BpsCtrl = BpsCtrl;
					Init_UARTn(RS485_3PORT);
				}
			}
			break;
		default:
			break;
	}
}
//初始化
//UART0=RS232
//UART1=GPRS
//UART2=RS485-1
//UART3=RS485-2
//UART4=RS485-3
//UART5=载波
//UART6=红外
//UART7=
//UART8=
//UART9=
//UART10=以太网通信口号
//UART11=
//UART12=交流采样通信口号(虚拟),使用DATABUFF
//速率控制码0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
void Terminal_UartInit_Manage(void)//Terminal_Uart初始化管理
{
  	UARTCtrl_TypeDef * UARTCtrl;
	RS485PortParaStruct PortPara;
	  
//RS232
	if(Get_LEN_UARTnCtrl(RS232PORT) != 0)//得到UART控制数据长度
	{
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS232PORT);
		UARTCtrl->BpsCtrl = RS232DefaultBPS;
		UARTCtrl->Function = UART_FUNC_MAINTAIN;
	  	Init_UARTn(RS232PORT);//初始化UART口,入口通信控制字已填入
	}
/*
//GPRS
	if(Get_LEN_UARTnCtrl(GPRSPORT)!=0)//得到UART控制数据长度
	{
		UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(GPRSPORT);
		UARTCtrl->BpsCtrl = GPRSDefaultBPS;
		UARTCtrl->Function = UART_FUNC_MAINTAIN;
	  	Init_UARTn(GPRSPORT);//初始化UART口,入口通信控制字已填入
	}
*/

//RS485-1
	if(Get_LEN_UARTnCtrl(RS485_1PORT) != 0)//得到UART控制数据长度
	{
		MC(0, (u32)&PortPara, sizeof(RS485PortParaStruct));
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
		
		MR((u32)&PortPara, ADDR_RS485PortParaTbl, sizeof(RS485PortParaStruct));	
		Refresh485PortFunction(RS485_1PORT, &PortPara);
		
		if((PortPara.Function == UART_FUNC_ATTACH) || 
		   (PortPara.Function == UART_FUNC_SLAVE) || 
		   (PortPara.Function == UART_FUNC_UPLINK))
		{
			UARTCtrl->BpsCtrl = ConvertToBpsCtrl(PortPara.BaudRate, PortPara.Parity, PortPara.DataBit, PortPara.StopBit);
			UARTCtrl->Function = UART_FUNC_MAINTAIN;
		}
		else
		{
			UARTCtrl->BpsCtrl = RS485DefaultBPS;
			UARTCtrl->Function = 1;
		}		
	  	Init_UARTn(RS485_1PORT);
		Pin_OutH(PIN_UART5_OE);
	}
//RS485-2
	if(Get_LEN_UARTnCtrl(RS485_2PORT)!=0)//得到UART控制数据长度
	{
		MC(0, (u32)&PortPara, sizeof(RS485PortParaStruct));
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
		
		MR((u32)&PortPara, ADDR_RS485PortParaTbl + sizeof(RS485PortParaStruct), sizeof(RS485PortParaStruct));
		Refresh485PortFunction(RS485_2PORT, &PortPara);

		if((PortPara.Function == UART_FUNC_ATTACH) || 
		   (PortPara.Function == UART_FUNC_SLAVE) || 
		   (PortPara.Function == UART_FUNC_UPLINK))
		{
			UARTCtrl->BpsCtrl = ConvertToBpsCtrl(PortPara.BaudRate, PortPara.Parity, PortPara.DataBit, PortPara.StopBit);
			UARTCtrl->Function = UART_FUNC_MAINTAIN;	
		}
		else
		{
			UARTCtrl->BpsCtrl = RS485DefaultBPS;
			UARTCtrl->Function = 1;
		}
	  	Init_UARTn(RS485_2PORT);
		Pin_OutH(PIN_UART7_OE);
	}

	#if ((Project/100)==2)||((Project/100)==3)	||((Project/100)==9)	
		//RS485-3
		if(Get_LEN_UARTnCtrl(RS485_3PORT)!=0)//得到UART控制数据长度
		{
			MC(0, (u32)&PortPara, sizeof(RS485PortParaStruct));
			UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_3PORT);
			
