gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
			MR((u32)&PortPara, ADDR_RS485PortParaTbl + (2 * sizeof(RS485PortParaStruct)), sizeof(RS485PortParaStruct));
			Refresh485PortFunction(RS485_3PORT, &PortPara);

			if((PortPara.Function == UART_FUNC_ATTACH) || 
			   (PortPara.Function == UART_FUNC_SLAVE) || 
			   (PortPara.Function == UART_FUNC_UPLINK))
			{
				UARTCtrl->BpsCtrl = ConvertToBpsCtrl(PortPara.BaudRate, PortPara.Parity, PortPara.DataBit, PortPara.StopBit);
				UARTCtrl->Function = UART_FUNC_MAINTAIN;
				
			}
			else
			{
				UARTCtrl->BpsCtrl = RS485DefaultBPS;
				UARTCtrl->Function = 1;
			}
		  	Init_UARTn(RS485_3PORT);
			Pin_OutH(PIN_USART3_OE);
		}
	#endif	
	#if ((Project/100)==3)	//负控终端
		if(Get_LEN_UARTnCtrl(PLC_PORT)!=0)	// PLC 端口即是遥信端口
		{
			UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PLC_PORT);
			UARTCtrl->BpsCtrl = PLCDefaultBPS;
			UARTCtrl->Function = 1;
		  	Init_UARTn(PLC_PORT);	
		}
	#endif

//红外
	if(Get_LEN_UARTnCtrl(IRPORT)!=0)//得到UART控制数据长度
	{
		UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(IRPORT);
		UARTCtrl->BpsCtrl = IRDefaultBPS;
	  	Init_UARTn(IRPORT);
	}

}


//接收发送
//UART0=RS232
//UART1=GPRS
//UART2=RS485-1
//UART3=RS485-2
//UART4=RS485-3
//UART5=载波
//UART6=红外
//UART7=
//UART8=
//UART9=
//UART10=以太网通信口号
//UART11=
//UART12=交流采样通信口号(虚拟),使用DATABUFF
#if ((Project/100)==2)||((Project/100)==3)||((Project/100)==9)
void Terminal_Uart_Manage(void)	//Terminal_Uart管理
{
	//u32 i;
  	//UARTCtrl_TypeDef * UARTCtrl;
	Comm_Ram_TypeDef* pComm_Ram = Comm_Ram;
	//u32 Addr1, Addr2, Addr3, Addr4, Addr5, Addr6;
	//i = sizeof("String");
	//Addr1 = ADDR_QCSG_ERAM_END;
	//Addr2 = ADDR_QCSG_ERAM_START;
	//Addr3 = ADDR_UARTnCtrl_End;
	//Addr4 = ADDR_UARTnCtrl_Start;
	//Addr5 = ADDR_Terminal_ERAM_Start;
	//Addr6 = ADDR_UARTnCtrl_End;
	if(pComm_Ram->POWER == 3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
	{
		UartPortManage(RS232PORT, (UartTaskCtrlStruct*)ADDR_RS232_Task_Ctrl);
		UartTaskProcess(RS232PORT, (UartTaskCtrlStruct*)ADDR_RS232_Task_Ctrl);

		UartPortManage(IRPORT, (UartTaskCtrlStruct*)ADDR_IR_Task_Ctrl);
		UartTaskProcess(IRPORT, (UartTaskCtrlStruct*)ADDR_IR_Task_Ctrl);

		UartPortManage(RS485_1PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH1_Task_Ctrl);
		UartTaskProcess(RS485_1PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH1_Task_Ctrl);

		UartPortManage(RS485_2PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH2_Task_Ctrl);
		UartTaskProcess(RS485_2PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH2_Task_Ctrl);

		UartPortManage(RS485_3PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH3_Task_Ctrl);
		UartTaskProcess(RS485_3PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH3_Task_Ctrl);
		
		UartPortManage(PLC_PORT, (UartTaskCtrlStruct*)ADDR_PLC_YX_UART_Task_Ctrl);
		UartTaskProcess(PLC_PORT, (UartTaskCtrlStruct*)ADDR_PLC_YX_UART_Task_Ctrl);

	}

	EthernetModuleManage(ENETPORT);

	GPRSModuleManage(GPRSPORT);
}
#endif

#if ((Project/100)==5)
void Terminal_Uart_Manage(void)	//Terminal_Uart管理
{
	//u32 i;
  	//UARTCtrl_TypeDef * UARTCtrl;
	Comm_Ram_TypeDef* pComm_Ram = Comm_Ram;
	//u32 Addr1, Addr2, Addr3, Addr4, Addr5, Addr6;
	//i = sizeof("String");
	//Addr1 = ADDR_QCSG_ERAM_END;
	//Addr2 = ADDR_QCSG_ERAM_START;
	//Addr3 = ADDR_UARTnCtrl_End;
	//Addr4 = ADDR_UARTnCtrl_Start;
	//Addr5 = ADDR_Terminal_ERAM_Start;
	//Addr6 = ADDR_UARTnCtrl_End;
	if(pComm_Ram->POWER == 3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
	{
		UartPortManage(IRPORT, (UartTaskCtrlStruct*)ADDR_IR_Task_Ctrl);
		UartTaskProcess(IRPORT, (UartTaskCtrlStruct*)ADDR_IR_Task_Ctrl);

		UartPortManage(RS485_1PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH1_Task_Ctrl);
		UartTaskProcess(RS485_1PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH1_Task_Ctrl);

		UartPortManage(RS485_2PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH2_Task_Ctrl);
		UartTaskProcess(RS485_2PORT, (UartTaskCtrlStruct*)ADDR_RS485_CH2_Task_Ctrl);

//		UartPortManage(PLC_PORT, (UartTaskCtrlStruct*)ADDR_PLC_YX_UART_Task_Ctrl);
//		UartTaskProcess(PLC_PORT, (UartTaskCtrlStruct*)ADDR_PLC_YX_UART_Task_Ctrl);
	}

	GPRSModuleManage(GPRSPORT);
}
#endif


void GPRSModuleManage(u32 PORTn)
{
	GPRS_QCSG_RxTx(GPRSPORT);	
	UartTaskProcess(GPRSPORT, (UartTaskCtrlStruct*)ADDR_GPRS_UART_Task_Ctrl);
	GPRSLinkMaintain(GPRSPORT);
}

void GPRSLinkMaintain(u32 PORTn)
{
	u32 Index = 0, FrameLen = 0;
	UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	CommunicationParaStruct CommPara;
	QCSGFrameStruct SrcFrame;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	if((u8)PORTn != GPRSPORT) return;
	
	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->LinkTask < 100) return;

	UartTask = GetUartTaskCtrl(PORTn);
	
	if((UARTCtrl->LinkTask == 100) && (pTerminalRam->GPRSHeartBeat_S_Timer == 0))
	{	
		MC(0, (u32)&SrcFrame, sizeof(QCSGFrameStruct));
		MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
		MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
		SrcFrame.A1 = CommPara.TerminalLocationCode;
		SrcFrame.A2 = CommPara.TerminalAddr;
		SrcFrame.A3 = 0x0000;
		SrcFrame.AFN = 0x02;
		SrcFrame.SEQ = 0x70 | (UARTCtrl->ReTxSEQ & 0x0F);
		SrcFrame.FC = 0x00C9;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x00;
		
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x10;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0xE0;

		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x01;
		SrcFrame.DataLen = Index;
		FrameLen = QCSG_BuildFrameByStruct(&SrcFrame, (u8*)Get_ADDR_UARTnTx(PORTn));
		UartTask->AckLen = FrameLen;
		pTerminalRam->CopyTxByte = FrameLen;
		UartTask->Flag |= UART_FLAG_TX_ACK;	
		pTerminalRam->GPRSHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
		pTerminalRam->GPRSHeartBeat_S_Timer *= 60;
		if(pTerminalRam->GPRSHeartBeat_S_Timer == 0) pTerminalRam->GPRSHeartBeat_S_Timer = 15*60;
		UARTCtrl->HeartberatCount = 0;
		UARTCtrl->ReTxSEQ++;
		return;
	}

		
				
	if((UARTCtrl->LinkTask == 101) && (pTerminalRam->GPRSHeartBeat_S_Timer == 0))
	{
	
#if (TEST_ON == 0)
		if((UARTCtrl->Task &  UART_TASK_TX) != 0) return;	//err20180404-22 GPRS丢帧错误
		if((UartTask->Flag & UART_FLAG_TX_TASK_FRAME) != 0) return;
#else 
		
		//if((UARTCtrl->Task &  UART_TASK_TX) != 0) return;	//err20180404-22 GPRS丢帧错误
		//if((UartTask->Flag & UART_FLAG_TX_TASK_FRAME) != 0) return;
		if(((UARTCtrl->Task &  UART_TASK_TX) != 0)||((UARTCtrl->Task &  UART_TASK_TXING) != 0)//如果有数据通信，重置心跳时间
		   ||((UARTCtrl->Task &  UART_TASK_TX_DONE) != 0)||((UartTask->Flag & UART_FLAG_TX_TASK_FRAME) != 0))
		{
			pTerminalRam->GPRSHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
			pTerminalRam->GPRSHeartBeat_S_Timer *= 60;
			if(pTerminalRam->GPRSHeartBeat_S_Timer == 0) pTerminalRam->GPRSHeartBeat_S_Timer = 15*60;
			return;
	   	}
#endif	
		
		
		if(UARTCtrl->HeartberatCount > 2)
		{
			UARTCtrl->ATCount = AT_MYPOWEROFF;//关机
			UARTCtrl->ATTask = 1;//AT任务:0=空闲,1=发送,2=正在发送,3=接收
			pTerminalRam->GPRSHeartBeat_S_Timer = 60;
		}
		else
		{
			MC(0, (u32)&SrcFrame, sizeof(QCSGFrameStruct));
			MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
			MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
			SrcFrame.A1 = CommPara.TerminalLocationCode;
			SrcFrame.A2 = CommPara.TerminalAddr;
			SrcFrame.A3 = 0x0000;
			SrcFrame.AFN = 0x02;
			SrcFrame.SEQ = 0x70 | (UARTCtrl->ReTxSEQ & 0x0F);
			SrcFrame.FC = 0x00C9;
			SrcFrame.Data[Index++] = 0x00;
			SrcFrame.Data[Index++] = 0x00;
			
			SrcFrame.Data[Index++] = 0x01;
			SrcFrame.Data[Index++] = 0x10;
			SrcFrame.Data[Index++] = 0x00;
			SrcFrame.Data[Index++] = 0xE0;

			SrcFrame.DataLen = Index;
			FrameLen = QCSG_BuildFrameByStruct(&SrcFrame, (u8*)Get_ADDR_UARTnTx(PORTn));
			pTerminalRam->CopyTxByte = FrameLen;
			UartTask->AckLen = FrameLen;
			UartTask->Flag |= UART_FLAG_TX_ACK;	
			pTerminalRam->GPRSHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
			pTerminalRam->GPRSHeartBeat_S_Timer *= 60;
			if(pTerminalRam->GPRSHeartBeat_S_Timer == 0) pTerminalRam->GPRSHeartBeat_S_Timer = 15*60;
			UARTCtrl->HeartberatCount++;
			UARTCtrl->ReTxSEQ++;
		}
		return;
	}
	if((UARTCtrl->LinkTask == 102) && (pTerminalRam->GPRSHeartBeat_S_Timer == 0))
	{
		MC(0, (u32)&SrcFrame, sizeof(QCSGFrameStruct));
		MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
		MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
		SrcFrame.A1 = CommPara.TerminalLocationCode;
		SrcFrame.A2 = CommPara.TerminalAddr;
		SrcFrame.A3 = 0x0000;
		SrcFrame.AFN = 0x02;
		SrcFrame.SEQ = 0x70 | (UARTCtrl->ReTxSEQ & 0x0F);
		SrcFrame.FC = 0x00C9;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x00;
		
		SrcFrame.Data[Index++] = 0x02;
		SrcFrame.Data[Index++] = 0x10;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0xE0;

		SrcFrame.DataLen = Index;
		FrameLen = QCSG_BuildFrameByStruct(&SrcFrame, (u8*)Get_ADDR_UARTnTx(PORTn));
		pTerminalRam->CopyTxByte = FrameLen;
		UartTask->AckLen = FrameLen;
		UartTask->Flag |= UART_FLAG_TX_ACK;	
		pTerminalRam->GPRSHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
		pTerminalRam->GPRSHeartBeat_S_Timer *= 60;
		if(pTerminalRam->GPRSHeartBeat_S_Timer == 0) pTerminalRam->GPRSHeartBeat_S_Timer = 15*60;
		UARTCtrl->ReTxSEQ++;
	}
}

void EthernetModuleManage(u32 PORTn)
{
	#if ((Project/100)==2)||((Project/100)==3)||((Project/100)==9)
		Ethernet_RxTx();
	#endif
	UartPortManage(ENETPORT, (UartTaskCtrlStruct*)ADDR_ETHE_UART_Task_Ctrl);
	UartTaskProcess(ENETPORT, (UartTaskCtrlStruct*)ADDR_ETHE_UART_Task_Ctrl);
	EthernetLinkMaintain(ENETPORT);
}

