gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
void EthernetLinkMaintain(u32 PORTn)
{
	u32 Index = 0, FrameLen = 0;
	UARTCtrl_TypeDef* UARTCtrl;
	UartTaskCtrlStruct* UartTask;
	CommunicationParaStruct CommPara;
	QCSGFrameStruct SrcFrame;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;

	if((u8)PORTn != ENETPORT) return;
	
	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->LinkTask < 100) return;

	UartTask = GetUartTaskCtrl(PORTn);

	//登录帧
	if((UARTCtrl->LinkTask == 100) && (pTerminalRam->ENETHeartBeat_S_Timer == 0))
	{	
		MC(0, (u32)&SrcFrame, sizeof(QCSGFrameStruct));
		MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
		MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
		SrcFrame.A1 = CommPara.TerminalLocationCode;
		SrcFrame.A2 = CommPara.TerminalAddr;
		SrcFrame.A3 = 0x0000;
		SrcFrame.AFN = 0x02;
		SrcFrame.SEQ = 0x70 | (UARTCtrl->ReTxSEQ & 0x0F);
		SrcFrame.FC = 0x00C9;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x00;
		
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x10;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0xE0;

		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x01;
		SrcFrame.DataLen = Index;
		FrameLen = QCSG_BuildFrameByStruct(&SrcFrame, (u8*)Get_ADDR_UARTnTx(PORTn));
		UartTask->AckLen = FrameLen;
		UartTask->Flag |= UART_FLAG_TX_ACK;	
		//pTerminalRam->ENETHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
		//pTerminalRam->ENETHeartBeat_S_Timer *= 60;
		//if(pTerminalRam->ENETHeartBeat_S_Timer == 0) pTerminalRam->ENETHeartBeat_S_Timer = 15*60;
		pTerminalRam->ENETHeartBeat_S_Timer = 60;
		UARTCtrl->HeartberatCount = 0;
		UARTCtrl->ReTxSEQ++;
		return;
	}
//心跳帧
	if((UARTCtrl->LinkTask == 101) && (pTerminalRam->ENETHeartBeat_S_Timer == 0))
	{
		if((UartTask->Flag & UART_FLAG_TX_ACK) != 0) return;
		if((UartTask->Flag & UART_FLAG_TX_TASK_FRAME) != 0) return;
		
		if(UARTCtrl->HeartberatCount > 2)
		{
			UARTCtrl->LinkTask = 0;
		}
		else
		{
			MC(0, (u32)&SrcFrame, sizeof(QCSGFrameStruct));
			MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
			MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
			SrcFrame.A1 = CommPara.TerminalLocationCode;
			SrcFrame.A2 = CommPara.TerminalAddr;
			SrcFrame.A3 = 0x0000;
			SrcFrame.AFN = 0x02;
			SrcFrame.SEQ = 0x70 | (UARTCtrl->ReTxSEQ & 0x0F);
			SrcFrame.FC = 0x00C9;
			SrcFrame.Data[Index++] = 0x00;
			SrcFrame.Data[Index++] = 0x00;
			
			SrcFrame.Data[Index++] = 0x01;
			SrcFrame.Data[Index++] = 0x10;
			SrcFrame.Data[Index++] = 0x00;
			SrcFrame.Data[Index++] = 0xE0;

			SrcFrame.DataLen = Index;
			FrameLen = QCSG_BuildFrameByStruct(&SrcFrame, (u8*)Get_ADDR_UARTnTx(PORTn));
			UartTask->AckLen = FrameLen;
			UartTask->Flag |= UART_FLAG_TX_ACK;	
			pTerminalRam->ENETHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
			pTerminalRam->ENETHeartBeat_S_Timer *= 60;
			if(pTerminalRam->ENETHeartBeat_S_Timer == 0) pTerminalRam->ENETHeartBeat_S_Timer = 15*60;
			UARTCtrl->HeartberatCount++;
			UARTCtrl->ReTxSEQ++;
		}	
		return;
	}
//退出登录帧
	if((UARTCtrl->LinkTask == 102) && (pTerminalRam->ENETHeartBeat_S_Timer == 0))
	{
		MC(0, (u32)&SrcFrame, sizeof(QCSGFrameStruct));
		MC(0, (u32)&CommPara, sizeof(CommunicationParaStruct));
		MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
		SrcFrame.A1 = CommPara.TerminalLocationCode;
		SrcFrame.A2 = CommPara.TerminalAddr;
		SrcFrame.A3 = 0x0000;
		SrcFrame.AFN = 0x02;
		SrcFrame.SEQ = 0x70 | (UARTCtrl->ReTxSEQ & 0x0F);
		SrcFrame.FC = 0x00C9;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0x00;
		
		SrcFrame.Data[Index++] = 0x02;
		SrcFrame.Data[Index++] = 0x10;
		SrcFrame.Data[Index++] = 0x00;
		SrcFrame.Data[Index++] = 0xE0;

		SrcFrame.DataLen = Index;
		FrameLen = QCSG_BuildFrameByStruct(&SrcFrame, (u8*)Get_ADDR_UARTnTx(PORTn));
		UartTask->AckLen = FrameLen;
		UartTask->Flag |= UART_FLAG_TX_ACK;	
		pTerminalRam->ENETHeartBeat_S_Timer = bcd_hex(CommPara.HeartBeatTimeGap);
		pTerminalRam->ENETHeartBeat_S_Timer *= 60;
		if(pTerminalRam->ENETHeartBeat_S_Timer == 0) pTerminalRam->ENETHeartBeat_S_Timer = 15*60;
		UARTCtrl->ReTxSEQ++;
	}

}


void QCSG_Local_Protocol_Req_Process(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u8* pData;
	u32 FrameLen = 0;		//, PortBufLen = 0;
	UARTCtrl_TypeDef* UARTCtrl;	
	UartRxChCtrlStruct* UartRxChCtrl;
	
	UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
	pData = (u8*)Get_ADDR_UARTnRx(PORTn);

	FrameLen = UARTCtrl->RxByte;
	if((u16)FrameLen != UARTCtrl->RxByte)
	{
		FrameLen = UARTCtrl->RxByte;
	}

	UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(PORTn);

	if(UartRxChCtrl == NULL) return;
	if(UartRxChCtrl->Empty != BUFFER_EMPTY) return;

	//PortBufLen = GetUartPortRxBufLen(PORTn);
	//if(FrameLen > PortBufLen) FrameLen = PortBufLen;

	UartRxChCtrl->SrcPort = PORTn;
	UartRxChCtrl->Empty = BUFFER_FULL;
	UartRxChCtrl->FrameType = UARTCtrl->FrameType;
	UartRxChCtrl->DataType = DATA_TYPE_FRAME;
	UartRxChCtrl->Flag |= UART_FRAME_INDICATION;
	UartRxChCtrl->FrameLen = FrameLen;
	UartRxChCtrl->FrameBuf = pData;
	//UartRxChCtrl->FrameBuf = (u8*)GetUartPortRxBuf(PORTn, DATA_TYPE_FRAME);
	//MR((u32)UartRxChCtrl->FrameBuf, (u32)pData, FrameLen);	

	//UartTask->Flag |= UART_FLAG_RX_BUF_READ_DONE;
	//MC(0, Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
	//UARTCtrl->RxByte = 0;
	//UARTCtrl->Task = UART_TASK_RX;
	//UARTCtrl->FrameType = FRAME_TYPE_NONE;
	//UARTCtrl->Lock = UART_UNLOCK;
}


void DLT_645_Protocol_Req_Process(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u8* pData;
	u32 FrameLen = 0;		// PortBufLen = 0;
	UARTCtrl_TypeDef* UARTCtrl;	
	UartRxChCtrlStruct* UartRxChCtrl;
	
	UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
	pData = (u8*)Get_ADDR_UARTnRx(PORTn);

	FrameLen = UARTCtrl->RxByte;
	if((u16)FrameLen != UARTCtrl->RxByte)
	{
		FrameLen = UARTCtrl->RxByte;
	}
//  以下三行用于回显调试	
//	MR(Get_ADDR_UARTnTx(PORTn), Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
//	UARTCtrl->TxByte = UARTCtrl->RxByte;
//	UartTask->Flag |= UART_FLAG_TX_ACK;

	UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(PORTn);

	if(UartRxChCtrl == NULL) return;
	if(UartRxChCtrl->Empty != BUFFER_EMPTY) return;

	//PortBufLen = GetUartPortRxBufLen(PORTn);
	//if(FrameLen > PortBufLen) FrameLen = PortBufLen;

	UartRxChCtrl->SrcPort = PORTn;
	UartRxChCtrl->Empty = BUFFER_FULL;
	UartRxChCtrl->FrameType = UARTCtrl->FrameType;
	UartRxChCtrl->DataType = DATA_TYPE_FRAME;
	UartRxChCtrl->Flag |= UART_FRAME_INDICATION;
	UartRxChCtrl->FrameLen = FrameLen;
	UartRxChCtrl->FrameBuf = pData;
	//UartRxChCtrl->FrameBuf = (u8*)GetUartPortRxBuf(PORTn, DATA_TYPE_FRAME);
	//MR((u32)UartRxChCtrl->FrameBuf, (u32)pData, FrameLen);

