gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
	//UartTask->Flag |= UART_FLAG_RX_BUF_READ_DONE;
	//MC(0, Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
	//UARTCtrl->RxByte = 0;
	//UARTCtrl->Task = UART_TASK_RX;
	//UARTCtrl->FrameType = FRAME_TYPE_NONE;
	//UARTCtrl->Lock = UART_UNLOCK;

}

void Mixed_645_Protocol_Req_Process(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u8* pData;
	u32 FrameLen = 0;		
	UARTCtrl_TypeDef* UARTCtrl;	
	UartRxChCtrlStruct* UartRxChCtrl;
	
	UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
	pData = (u8*)Get_ADDR_UARTnRx(PORTn);

	FrameLen = UARTCtrl->RxByte;
	if((u16)FrameLen != UARTCtrl->RxByte)
	{
		FrameLen = UARTCtrl->RxByte;
	}

	UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(PORTn);

	if(UartRxChCtrl == NULL) return;
	if(UartRxChCtrl->Empty != BUFFER_EMPTY) return;

	UartRxChCtrl->SrcPort = PORTn;
	UartRxChCtrl->Empty = BUFFER_FULL;
	UartRxChCtrl->FrameType = UARTCtrl->FrameType;
	UartRxChCtrl->DataType = DATA_TYPE_FRAME;
	UartRxChCtrl->Flag |= UART_FRAME_INDICATION;
	UartRxChCtrl->FrameLen = FrameLen;
	UartRxChCtrl->FrameBuf = pData;
	UARTCtrl->FrameType = FRAME_TYPE_NONE;
	
	
}

void EDMI_Protocol_Req_Process(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	
	u8* pData;
	u32 FrameLen = 0;		// PortBufLen = 0;
	UARTCtrl_TypeDef* UARTCtrl;	
	UartRxChCtrlStruct* UartRxChCtrl;
	
	UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
	pData = (u8*)Get_ADDR_UARTnRx(PORTn);

	FrameLen = UARTCtrl->RxByte;
	if((u16)FrameLen != UARTCtrl->RxByte)
	{
		FrameLen = UARTCtrl->RxByte;
	}
	UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(PORTn);

	if(UartRxChCtrl == NULL) return;
	if(UartRxChCtrl->Empty != BUFFER_EMPTY) return;

	UartRxChCtrl->SrcPort = PORTn;
	UartRxChCtrl->Empty = BUFFER_FULL;
	UartRxChCtrl->FrameType = UARTCtrl->FrameType;
	UartRxChCtrl->DataType = DATA_TYPE_FRAME;
	UartRxChCtrl->Flag |= UART_FRAME_INDICATION;
	UartRxChCtrl->FrameLen = FrameLen;
	UartRxChCtrl->FrameBuf = pData;

}



void QCSG_UnKnown_Protocol_Req_Process(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u8* pData;
	u32 FrameLen = 0;
	UARTCtrl_TypeDef* UARTCtrl;	
	UARTCtrl = (UARTCtrl_TypeDef*)Get_ADDR_UARTnCtrl(PORTn);
	pData = (u8*)Get_ADDR_UARTnRx(PORTn);

	FrameLen = UARTCtrl->RxByte;
	if((u16)FrameLen != UARTCtrl->RxByte)
	{
		FrameLen = UARTCtrl->RxByte;
	}
	if((u16)FrameLen > SIZE_2K) FrameLen = SIZE_2K;	

	MC(0, (u32)pData, UARTCtrl->RxByte);
	UARTCtrl->RxByte = 0;
	UARTCtrl->Task = UART_TASK_RX;
	UARTCtrl->FrameType = FRAME_TYPE_NONE;
	UARTCtrl->Lock = UART_UNLOCK;
}

/*
void UartTaskProcess(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u16* p16timer;
	u32 Addr = 0;
	UARTCtrl_TypeDef* UARTCtrl;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);	
	if((UartTask->Flag & UART_FLAG_RX_DONE) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_RX_DONE;
		if(UartTask->State == UART_STATE_WAIT_ACK) 
		{
			UartTask->AckTiemOutSetByTask = 0;
			UartTask->WaitAckTimeOut = 0;
			UartTask->State = UART_STATE_IDLE;
		}
		switch(UARTCtrl->FrameType)
		{
			case FRAME_TYPE_QCSG_UP:				
				QCSG_Up_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_QCSG_LOCAL:
				QCSG_Local_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_DLT_645:
				DLT_645_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_UNKNOWN:
				UartTask->Flag &= ~UART_FLAG_RX_DONE;
				QCSG_UnKnown_Protocol_Req_Process(PORTn, UartTask);
				break;
			default:
				break;			
		}
	}

	if((UartTask->Flag & UART_FLAG_RX_BUF_READ_DONE) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_RX_BUF_READ_DONE;
		MC(0, Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
		UARTCtrl->Round = 0;
		UARTCtrl->RxByte = 0;
		UARTCtrl->Task = UART_TASK_RX;
		UARTCtrl->FrameType = FRAME_TYPE_NONE;
		UARTCtrl->Lock = UART_UNLOCK;
	}

	if((UartTask->Flag & UART_FLAG_TX_DONE) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_TX_DONE;
		if(UartTask->NeedAck == 0)
		{
			UartTask->FrameType = FRAME_TYPE_NONE;	
			UartTask->SrcTaskID = TASK_ID_NONE;
			UartTask->State = UART_STATE_IDLE;
		}
		else
		{
			UartTask->State = UART_STATE_WAIT_ACK;
			if(UartTask->AckTiemOutSetByTask == 0)
			{
				UartTask->WaitAckTimeOut = UART_DEFAULT_ACK_TIME;
			}
			else
			{
				UartTask->WaitAckTimeOut = UartTask->AckTiemOutSetByTask;
			}		
		}
		UartTask->FrameLen = 0;
		UartTask->RetryCnt = 0;
	}

	if((UartTask->Flag & UART_FLAG_WAIT_ACK_TIME_OUT) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_WAIT_ACK_TIME_OUT;
		UartTask->FrameType = FRAME_TYPE_NONE;	
		UartTask->SrcTaskID = TASK_ID_NONE;
		UartTask->State = UART_STATE_IDLE;
		UartTask->AckTiemOutSetByTask = 0;
	}

	if((UartTask->Flag & UART_FLAG_TX_TIME_OUT) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_TX_TIME_OUT;
		if(UartTask->RetryCnt > 0)
		{
			UartTask->RetryCnt--;
			UARTCtrl->Task = UART_TASK_TX;
			p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
			if(PORTn != GPRSPORT)
			{
				UARTCtrl->TxByte = UartTask->FrameLen;
				p16timer[0] = UART_TX_TIME_OUT;
				Start_UARTn_Tx(PORTn);
			}
			else
			{
				pTerminalRam->CopyTxByte = UartTask->FrameLen;
				p16timer[0] = GPRS_UART_TX_TIME_OUT;
			}
		}
		else
		{
			UartTask->State = UART_STATE_IDLE;
			UartTask->SrcTaskID = TASK_ID_NONE;
			UartTask->FrameLen = 0;
			UartTask->RetryCnt = 0;
		}
	}

	if((UartTask->Flag & UART_FLAG_TX_TASK_FRAME) != 0)
	{
		p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
		if((PORTn != GPRSPORT) && (p16timer[0] != 0)) return;
	
		UartTask->Flag &= ~UART_FLAG_TX_TASK_FRAME;
		if((UartTask->FrameBuf == NULL) || (UartTask->FrameLen == 0)) return;
		if((PORTn != GPRSPORT) && (UartTask->BpsCtrl != 0) && (UartTask->BpsCtrl != UARTCtrl->BpsCtrl))
		{
			switch(UartTask->BpsCtrl)
			{
				case BPS_300:
				case BPS_600:
				case BPS_1200:
				case BPS_2400:
				case BPS_4800:
				case BPS_9600:
				case BPS_19200:
				case BPS_38400:
				case BPS_57600:
				case BPS_115200:
				case BPS_230400:
					UARTCtrl->BpsCtrl = UartTask->BpsCtrl;
					Init_UARTn(PORTn);
					break;
				default:
					UartTask->BpsCtrl = UARTCtrl->BpsCtrl;
					break;		
			}		
		}	
		UartTask->State = UART_STATE_SEND_TASK_FRAME;	
		Addr = Get_ADDR_UARTnTx(PORTn);
		MR(Addr, (u32)UartTask->FrameBuf, UartTask->FrameLen);	
		UARTCtrl->Task = UART_TASK_TX;
		if(PORTn != GPRSPORT)
		{
			UARTCtrl->TxByte = UartTask->FrameLen;
			UARTCtrl->TxCount = 0;
			p16timer[0] = UART_TX_TIME_OUT;
			if(UartTask->AckTiemOutSetByTask != 0)
			{
				p16timer[0] = UartTask->AckTiemOutSetByTask * 100;
			}
			Start_UARTn_Tx(PORTn);
		}
		else
		{
			pTerminalRam->CopyTxByte = UartTask->FrameLen;
			p16timer[0] = GPRS_UART_TX_TIME_OUT;
			if(UartTask->AckTiemOutSetByTask != 0)
			{
				p16timer[0] += UartTask->AckTiemOutSetByTask * 100;
			}
		}	
		return;
	}

