gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
	if(((UartTask->Flag & UART_FLAG_TX_ACK) != 0) && (UartTask->State == UART_STATE_IDLE))
	{// 响应此标志位任务前已设置好对应串口发送的数据与长度
		UartTask->Flag &= ~UART_FLAG_TX_ACK;
		UartTask->NeedAck = 0;
		UartTask->RetryCnt = 0;
		UartTask->State = UART_STATE_SEND_LOCAL_RESPONSE;
		UARTCtrl->Task = UART_TASK_TX;
		p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
		if(PORTn != GPRSPORT)
		{
			UARTCtrl->TxByte = UartTask->AckLen;
			UARTCtrl->TxCount = 0;		
			p16timer[0] = UART_TX_TIME_OUT;
			Start_UARTn_Tx(PORTn);
		}
		else
		{
			pTerminalRam->CopyTxByte = UartTask->AckLen;
			p16timer[0] = GPRS_UART_TX_TIME_OUT;
		}
	}	
}
*/

void UartTaskProcess(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u16* p16timer;
	u32 Addr = 0;
	UARTCtrl_TypeDef* UARTCtrl;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	
	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);	
	if((UartTask->Flag & UART_FLAG_RX_DONE) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_RX_DONE;
		switch(UARTCtrl->FrameType)
		{
			case FRAME_TYPE_QCSG_UP:				
				QCSG_Up_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_QCSG_LOCAL:
				QCSG_Local_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_DLT_645:
				DLT_645_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_UNKNOWN:
				QCSG_UnKnown_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_MIXED_645:
				Mixed_645_Protocol_Req_Process(PORTn, UartTask);
				break;
			case FRAME_TYPE_EDMI:
				EDMI_Protocol_Req_Process(PORTn, UartTask);
				break;
			default:
				break;			
		}
	}

	if((UartTask->Flag & UART_FLAG_RX_BUF_READ_DONE) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_RX_BUF_READ_DONE;
		MC(0, Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
		UARTCtrl->Round = 0;
		UARTCtrl->RxByte = 0;
		UARTCtrl->Task = UART_TASK_RX;
		UARTCtrl->FrameType = FRAME_TYPE_NONE;
		UARTCtrl->Lock = UART_UNLOCK;
	}

	if((UartTask->Flag & UART_FLAG_TX_DONE) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_TX_DONE;
		UartTask->FrameType = FRAME_TYPE_NONE;	
		UartTask->SrcTaskID = TASK_ID_NONE;
		UartTask->State = UART_STATE_IDLE;
		UartTask->FrameLen = 0;
		UartTask->AckLen = 0;
		UartTask->Flag = 0;
		UartTask->RetryCnt = 0;
	}

	if((UartTask->Flag & UART_FLAG_TX_TIME_OUT) != 0)
	{
		UartTask->Flag &= ~UART_FLAG_TX_TIME_OUT;
		UartTask->State = UART_STATE_IDLE;
		UartTask->SrcTaskID = TASK_ID_NONE;
		UartTask->FrameType = FRAME_TYPE_NONE;
		UartTask->FrameLen = 0;
		UartTask->AckLen = 0;
		UartTask->Flag = 0;
		UartTask->RetryCnt = 0;
	}

	if(((UartTask->Flag & UART_FLAG_TX_ACK) != 0) && (UartTask->State == UART_STATE_IDLE))
	{// 响应此标志位任务前已设置好对应串口发送的数据与长度
		UartTask->Flag &= ~UART_FLAG_TX_ACK;
		UartTask->NeedAck = 0;
		UartTask->RetryCnt = 0;
		UartTask->State = UART_STATE_SEND_LOCAL_RESPONSE;
		UARTCtrl->Task = UART_TASK_TX;
		p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
		if(PORTn != GPRSPORT)
		{
			UARTCtrl->TxByte = UartTask->AckLen;
			UARTCtrl->TxCount = 0;		
			p16timer[0] = UART_TX_TIME_OUT;
			Start_UARTn_Tx(PORTn);
		}
		else
		{
#if ((Project/100)==5)
			SetPortTxLed(GPRSPORT);
#endif
			pTerminalRam->CopyTxByte = UartTask->AckLen;
			p16timer[0] = GPRS_UART_TX_TIME_OUT;
		}
		return;
	}	

	if((UartTask->Flag & UART_FLAG_TX_TASK_FRAME) != 0)
	{
		p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
		if((PORTn != GPRSPORT) && (p16timer[0] != 0)) return;
	
		UartTask->Flag &= ~UART_FLAG_TX_TASK_FRAME;
		if((UartTask->FrameBuf == NULL) || (UartTask->FrameLen == 0)) return;
		if((PORTn != GPRSPORT) && (UartTask->BpsCtrl != 0) && (UartTask->BpsCtrl != UARTCtrl->BpsCtrl))
		{	
			UARTCtrl->BpsCtrl = UartTask->BpsCtrl;
			Init_UARTn(PORTn);
		}	
		UartTask->State = UART_STATE_SEND_TASK_FRAME;	
		Addr = Get_ADDR_UARTnTx(PORTn);
		MR(Addr, (u32)UartTask->FrameBuf, UartTask->FrameLen);	
		UARTCtrl->Task = UART_TASK_TX;
		if(PORTn != GPRSPORT)
		{
			UARTCtrl->TxByte = UartTask->FrameLen;
			UARTCtrl->TxCount = 0;
			p16timer[0] = UART_TX_TIME_OUT;
			if(UartTask->AckTiemOutSetByTask != 0)
			{
				p16timer[0] = UartTask->AckTiemOutSetByTask * 100;
			}
			Start_UARTn_Tx(PORTn);
		}
		else
		{
#if ((Project/100)==5)
			SetPortTxLed(GPRSPORT);
#endif
			pTerminalRam->CopyTxByte = UartTask->FrameLen;
			p16timer[0] = GPRS_UART_TX_TIME_OUT;
			if(UartTask->AckTiemOutSetByTask != 0)
			{
				p16timer[0] += UartTask->AckTiemOutSetByTask * 100;
			}
		}	
		return;
	}

	//if((PORTn == GPRSPORT) && (UartTask->State != UART_STATE_IDLE))
	if(UartTask->State != UART_STATE_IDLE)
	{
		p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);
		if(p16timer[0] == 0) 
		{
			UartTask->State = UART_STATE_IDLE;
		}
	}
}

void UartPortManage(u32 PORTn, UartTaskCtrlStruct* UartTask)
{
	u16* p16timer;
  	UARTCtrl_TypeDef* UARTCtrl;

  	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);

	switch(UARTCtrl->Task)
	{
		case UART_TASK_RX:
			UartReveiveFrame(PORTn);
			break;
		case UART_TASK_RX_DONE:
			if(UARTCtrl->Protocol == 0)
			{
				if(PORTn == IRPORT)
				{
					UARTCtrl->Round++;
					if((UARTCtrl->Round > 250) && (UARTCtrl->Lock != UART_LOCK))
					{
						UARTCtrl->Round = 0;
						UartTask->Flag |= UART_FLAG_RX_DONE;
						UartTask->FrameLen = UARTCtrl->RxByte;
						UartTask->FrameType = UARTCtrl->FrameType;
						UartTask->FrameBuf = (u8*)Get_ADDR_UARTnRx(PORTn);
						UARTCtrl->Lock = UART_LOCK;
						p16timer[0] = 300;
					}
				}
				else if(PORTn == ENETPORT)
				{
					UARTCtrl->Round++;
					if((UARTCtrl->Round > 100) && (UARTCtrl->Lock != UART_LOCK))
					{
						UARTCtrl->Round = 0;
						UartTask->Flag |= UART_FLAG_RX_DONE;
						UartTask->FrameLen = UARTCtrl->RxByte;
						UartTask->FrameType = UARTCtrl->FrameType;
						UartTask->FrameBuf = (u8*)Get_ADDR_UARTnRx(PORTn);
						UARTCtrl->Lock = UART_LOCK;
						p16timer[0] = 300;
					}
				}
				else
				{
					if(UARTCtrl->Lock != UART_LOCK)
					{
						UartTask->Flag |= UART_FLAG_RX_DONE;
						UartTask->FrameLen = UARTCtrl->RxByte;
						UartTask->FrameType = UARTCtrl->FrameType;
						UartTask->FrameBuf = (u8*)Get_ADDR_UARTnRx(PORTn);
						UARTCtrl->Lock = UART_LOCK;
						p16timer[0] = 300;
					}
				}	

