gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
				if((UARTCtrl->Lock == UART_LOCK) && (p16timer[0] == 0))
				{
					MC(0, Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
					UARTCtrl->Round = 0;
					UARTCtrl->RxByte = 0;
					UARTCtrl->Task = UART_TASK_RX;
					UARTCtrl->FrameType = FRAME_TYPE_NONE;
					UARTCtrl->Lock = UART_UNLOCK;
				}
			}			
			break;
		case UART_TASK_RX_TIMEOUT:
			if(UARTCtrl->Protocol == 0)
			{
				MC(0, Get_ADDR_UARTnRx(PORTn), UARTCtrl->RxByte);
				UARTCtrl->RxByte = 0;
				UARTCtrl->Task = UART_TASK_RX;
				UARTCtrl->FrameType = FRAME_TYPE_NONE;
				UARTCtrl->Lock = UART_UNLOCK;
			}						
			break;
		case UART_TASK_TX:
			if(UARTCtrl->Protocol == 0)
			{
				SetPortTxLed(PORTn);
				if(p16timer[0] == 0) 
				{
					UARTCtrl->TxByte = 0;
					UARTCtrl->Task = UART_TASK_RX;
					UARTCtrl->FrameType = FRAME_TYPE_NONE;
					UARTCtrl->Lock = UART_UNLOCK;
					UARTCtrl->BpsCtrl = GetUartPortBpsCtrl(PORTn);
					UartTask->Flag |= UART_FLAG_TX_TIME_OUT;
					Init_UARTn(PORTn);
				}				
				if(Wait_UARTn_Tx(PORTn) == 0)
				{
					if(PORTn == PLC_PORT)
					{
						#if LOG_1376_2==1//0=没,1=有
							LOG(13762,1,PLC_PORT,(u8*)Get_ADDR_UARTnTx(PORTn), UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
						#endif
					}
					MC(0, Get_ADDR_UARTnTx(PORTn), UARTCtrl->TxByte);
					p16timer[0] = 0;
					UARTCtrl->TxByte = 0;
					UARTCtrl->Task = UART_TASK_RX;
					UARTCtrl->FrameType = FRAME_TYPE_NONE;
					UARTCtrl->Lock = UART_UNLOCK;
					UartTask->Flag |= UART_FLAG_TX_DONE;
				}
				
			}			
			break;
		case UART_TASK_TX_DONE:			//以太网发送数据完成后，会将 Task 设置为 7，表示发送完成
			if(UARTCtrl->Protocol == 0)
			{
				MC(0, Get_ADDR_UARTnTx(PORTn), UARTCtrl->TxByte);
				p16timer[0] = 0;
				UARTCtrl->RxByte = 0;
				UARTCtrl->TxByte = 0;
				UARTCtrl->Task = UART_TASK_RX;
				UARTCtrl->FrameType = FRAME_TYPE_NONE;
				UARTCtrl->Lock = UART_UNLOCK;
				UartTask->Flag |= UART_FLAG_TX_DONE;
			}
			
			break;
		default:
			if(UARTCtrl->Protocol == 0)
			{
				UARTCtrl->Lock = UART_UNLOCK;
				UARTCtrl->TxByte = 0;
				UARTCtrl->RxByte = 0;
				UARTCtrl->Task = UART_TASK_RX;
				UARTCtrl->FrameType = FRAME_TYPE_NONE;
			}			
			break;
	}
}


u32 UartReveiveFrame(u32 PORTn)
{	
	u8* p8fifo;
	u16* p16fifo;
	u8* p8rx;
	u16* p16timer;
  	UARTCtrl_TypeDef* UARTCtrl;
	u8 Temp645Addr[6], TempMeterAddr[6];
	u32 LEN_UARTnRx, LEN_UARTnIntRx, pWrite, pRead, RxByte;
	u32 i = 0, Sum = 0;
	
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;

//	u8 p8rx_EDMI[100];	//接收到的帧
//	u8 p8rx_EDMI_Real[100];//除去0X10并减去0x40 处理后的原始帧
//	u32 RxByte_EDMI,RxByte_EDMI_Real;
	u16 crc16;
	
  	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LEN_UARTnIntRx = Get_LEN_UARTnIntRx(PORTn);
	p16timer = (u16*)Get_ADDR_UARTnTimer(PORTn);	
	p16fifo = (u16*)Get_ADDR_UARTn(PORTn);
	DMA_UARTn_RX_Pointer(PORTn);					// 计算DMA_UARTn接收指针值(p0)
	pWrite = p16fifo[0];							// 中断接收指针
	pRead  = p16fifo[1];							// 当前已读指针
	if((pWrite >= (LEN_UARTnIntRx - 10)) || ( pRead >= (LEN_UARTnIntRx - 10)))
	{
		pWrite = p16fifo[0];							// 中断接收指针
		pRead  = p16fifo[1];
		if((pWrite >= (LEN_UARTnIntRx - 10)) || ( pRead >= (LEN_UARTnIntRx - 10)))
		{
			p16fifo[0] = 0;		// 中断接收指针
			p16fifo[1] = 0;		// 当前已读指针
			p16fifo[2] = 0;		// 规约检查指针
			p16fifo[3] = 0;
			p16fifo[4] = 0;
			return 0;			// 返回: 0没完成, 1完成, 2超时
		}		
	}
	
	if((UARTCtrl->Protocol == 1) && (pWrite == pRead))
	{
		UARTCtrl->Protocol = 0;
	}
	if(pWrite != pRead)
	{//有数据接收,重置接收超时定时
		if(PORTn==RS485_1PORT)
		{
			pTerminalRam->RS485_1_RxLED_MS_Timer = 20/10;		// 11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
			UARTCtrl->FrameType = FRAME_TYPE_MIXED_645;
		}
		if(PORTn==RS485_2PORT)
		{
			#if ((Project/100)==2)||((Project/100)==3)||((Project/100)==4)	||((Project/100)==9)	
				pTerminalRam->RS485_2_RxLED_MS_Timer = 20/10;		// 13 RS485抄表接收LED指示MS定时器,每10MS减1定时器
			#endif
			#if (Project/100)==5    //ybzyl20180601对于II型集中器，2路485的发送灯的毫秒定时器也使用1路485发送灯的毫秒定时器
				pTerminalRam->RS485_1_RxLED_MS_Timer = 20/10;		// 13 RS485抄表接收LED指示MS定时器,每10MS减1定时器
			#endif
			UARTCtrl->FrameType = FRAME_TYPE_MIXED_645;
		}
		if(PORTn==RS485_3PORT)
		{
			pTerminalRam->RS485_3_RxLED_MS_Timer = 20/10;		// 15 RS485抄表接收LED指示MS定时器,每10MS减1定时器
			UARTCtrl->FrameType = FRAME_TYPE_MIXED_645;
		}

		if(PORTn==ENETPORT)
		{
			pTerminalRam->ENETLED_MS_Timer = 20/10;		
		}
		if(PORTn==GPRSPORT)
		{
			pTerminalRam->GPRS_RxLED_MS_Timer = 100/10;		
		}
		p8fifo = (u8*)(Get_ADDR_UARTn(PORTn)+10);
	  	p8rx = (u8*)Get_ADDR_UARTnRx(PORTn);
		LEN_UARTnRx = Get_LEN_UARTnRx(PORTn);
		if(PORTn == ENETPORT)
		{
			p16timer[0] = RCV_ENET_FRAME_TIME_OUT;				// 以太网模块超时定时 10S
		}
		else if(PORTn == GPRSPORT)
		{
			p16timer[0] = RCV_GPRS_FRAME_TIME_OUT;				// GPRS无线通信模块超时定时 10S
		}
		else if(PORTn == SMSPORT)
		{
			p16timer[0] = RCV_SMS_FRAME_TIME_OUT;				// 短信通道超时定时 60S
		}
		else
		{//如果是波特率1200的红相表 1s的超时时间可能不够。需要2s或3s
			p16timer[0] = RCV_UART_FRAME_TIME_OUT;				// 其他通道 1000ms
			
		}
	}

	RxByte = UARTCtrl->RxByte;
	while(pWrite != pRead)
	{
		if(RxByte >= LEN_UARTnRx) RxByte = 0;

		i = p8fifo[pRead++];
		if(pRead >= (LEN_UARTnIntRx-10)) pRead = 0;
		p8rx[RxByte++] = i;

		if((p8rx[0] != DLT_645_HEAD) && (p8rx[0] != EDMI_HEAD) )
		{
			if(RxByte == 1) 
			{
				UARTCtrl->Jump_Flag = 0;//开始清零标识
				if(i == DLT_645_HEAD)//帧头判断
				{
					;//DLT645_EDMI_Flag = 1;//645
				}
				else if(i == EDMI_HEAD)//帧头判断
				{
					;//DLT645_EDMI_Flag = 2;//EDMI
				}
				else
				{
					RxByte = 0;
					//UARTCtrl->RxByte = 0;
					UARTCtrl->Jump_Flag = 0;//开始清零标识
					p16fifo[1] = pRead;		//当前已读指针
					continue;
				}
			}
			else RxByte = 0;
		}
		else if(p8rx[0] == DLT_645_HEAD)
		{
			if(RxByte < MIN_645_FRAME_LEN) continue;

			if((p8rx[7] == DLT_645_HEAD) && (RxByte == (12 + p8rx[9])) && (i == DLT_645_TAIL))
			{// DLT645帧格式检查
				Sum = SumCaculation(p8rx, 10 + p8rx[9]);
				if((u8)Sum != p8rx[10 + p8rx[9]]) 
				{
					p16fifo[1] = pRead;		//当前已读指针
					p16fifo[2] = pRead;		//检查指针==读指针,免检省时
					p16fifo[3] = pRead;		//检查指针==读指针,免检省时
					p16fifo[4] = pRead;		//检查指针==读指针,免检省时
					UARTCtrl->RxByte = 0;
					//DLT645_EDMI_Flag = 0;//无类型
					return 0;	
				}
				if(UARTCtrl->Function == UART_FUNC_MAINTAIN)		// UARTCtrl->Function == 0,表示维护口
				{
					#if ((Project/100)==2)||((Project/100)==3)||((Project/100)==9)		
						MR((u32)TempMeterAddr, (u32)ADDR_04000401, 6);
					#endif
					Temp645Addr[0] = p8rx[1]; Temp645Addr[1] = p8rx[2];
					Temp645Addr[2] = p8rx[3]; Temp645Addr[3] = p8rx[4];
					Temp645Addr[4] = p8rx[5]; Temp645Addr[5] = p8rx[6];
					
					if((TempMeterAddr[0] == Temp645Addr[0]) && (TempMeterAddr[1] == Temp645Addr[1]) && 
			   		   (TempMeterAddr[2] == Temp645Addr[2]) && (TempMeterAddr[3] == Temp645Addr[3]) && 
			   		   (TempMeterAddr[4] == Temp645Addr[4]) && (TempMeterAddr[5] == Temp645Addr[5]))
					{//  与本地交采地址相等
						UARTCtrl->Protocol = 1;
						return 0;
					}

					if((Temp645Addr[0] == 0xAA) && (Temp645Addr[1] == 0xAA) && 
					   (Temp645Addr[2] == 0xAA) && (Temp645Addr[3] == 0xAA) && 
					   (Temp645Addr[4] == 0xAA) && (Temp645Addr[5] == 0xAA))
					{
						UARTCtrl->Protocol = 1;
						return 0;
					}

					if((Temp645Addr[0] == 0x99) && (Temp645Addr[1] == 0x99) && 
					   (Temp645Addr[2] == 0x99) && (Temp645Addr[3] == 0x99) && 
					   (Temp645Addr[4] == 0x99) && (Temp645Addr[5] == 0x99))
					{
						UARTCtrl->Protocol = 1;
						return 0;
					}
				}
				
