gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
				p16fifo[1] = pRead;		//当前已读指针
				p16fifo[2] = pRead;		//检查指针==读指针,免检省时
				p16fifo[3] = pRead;		//检查指针==读指针,免检省时
				p16fifo[4] = pRead;		//检查指针==读指针,免检省时
				UARTCtrl->RxByte = RxByte;
				UARTCtrl->Protocol = 0;
				UARTCtrl->FrameType = FRAME_TYPE_DLT_645;
				UARTCtrl->Task = UART_TASK_RX_DONE;
				return 1;				//返回0没完成,1完成,2超时
		
			}
			if((p8rx[1] == p8rx[3]) && (p8rx[2] == p8rx[4]) && (p8rx[5] == QCSG_FRAME_HEAD) && 
			   (RxByte == (8 + p8rx[1] + (p8rx[2] << 8))) && (i == QCSG_FRAME_TAIL))
			{// 南网上行帧格式检查
				Sum = SumCaculation(&p8rx[6], p8rx[1] + (p8rx[2] << 8));
				if((u8)Sum == p8rx[6 + p8rx[1] + (p8rx[2] << 8)])
				{
					p16fifo[1] = pRead;		//当前已读指针
					p16fifo[2] = pRead;		//检查指针==读指针,免检省时
					p16fifo[3] = pRead;		//检查指针==读指针,免检省时
					p16fifo[4] = pRead;		//检查指针==读指针,免检省时
					
					UARTCtrl->RxByte = RxByte;
					UARTCtrl->Protocol = 0;
					UARTCtrl->FrameType = FRAME_TYPE_QCSG_UP;
					UARTCtrl->Task = UART_TASK_RX_DONE;
					return 1;				//返回0没完成,1完成,2超时
				}
			}
			if((RxByte == (p8rx[1] + (p8rx[2] << 8))) && (i == DLT_645_TAIL))
			{// 南网下行帧格式检查
				Sum = SumCaculation(&p8rx[3], (p8rx[1] + (p8rx[2] << 8)) - 5);
				if((u8)Sum == p8rx[p8rx[1] + (p8rx[2] << 8) - 2])
				{
					p16fifo[1] = pRead;		//当前已读指针
					p16fifo[2] = pRead;		//检查指针==读指针,免检省时
					p16fifo[3] = pRead;		//检查指针==读指针,免检省时
					p16fifo[4] = pRead;		//检查指针==读指针,免检省时
					UARTCtrl->RxByte = RxByte;
					UARTCtrl->Protocol = 0;
					UARTCtrl->FrameType = FRAME_TYPE_QCSG_LOCAL;
					UARTCtrl->Task = UART_TASK_RX_DONE;
					return 1;				//返回0没完成,1完成,2超时
				}
			}
		}
		else if(p8rx[0] == EDMI_HEAD)
		{
			if(UARTCtrl->Jump_Flag == 1)//上一个字符是0x10 跳过判断
			{
				UARTCtrl->Jump_Flag = 0;
				if((i == 0x42)||(i == 0x43)||(i == 0x50)||(i == 0x51)||(i == 0x53))
				{
					p8rx[RxByte-2] = i - 0x40;
					RxByte--;
				}
				else 
				{
					UARTCtrl->Jump_Flag = 0;
					p16fifo[1] = pRead;		//当前已读指针
					p16fifo[2] = pRead;		//检查指针==读指针,免检省时
					p16fifo[3] = pRead;		//检查指针==读指针,免检省时
					p16fifo[4] = pRead;		//检查指针==读指针,免检省时
					UARTCtrl->RxByte = 0;
					return 0;
				}
			}
			else 
			{
				if(i == 0x10)	//判断是0x10则不存储该字节
				{
					UARTCtrl->Jump_Flag = 1;
					continue;
				}
				else 
				{
					if(RxByte < MIN_EDMI_FRAME_LEN) 
						continue;
					else 
					{	
						if(p8rx[1] != EDMI_FRAME_FLAG)
						{
							UARTCtrl->Jump_Flag = 0;
							p16fifo[1] = pRead;		//当前已读指针
							p16fifo[2] = pRead;		//检查指针==读指针,免检省时
							p16fifo[3] = pRead;		//检查指针==读指针,免检省时
							p16fifo[4] = pRead;		//检查指针==读指针,免检省时
							UARTCtrl->RxByte = 0;
							return 0;
						}
						if(i == EDMI_TAIL)//未经过0x10遇见0x03就是帧结尾
						{
							crc16 = cal_CRC16(p8rx,RxByte-3);
							if((p8rx[0] == EDMI_HEAD) && (p8rx[1] == EDMI_FRAME_FLAG) && (crc16 == ((p8rx[RxByte-3]<<8) + p8rx[RxByte-2])))
							{
								if(UARTCtrl->Function != UART_FUNC_MAINTAIN)		// UARTCtrl->Function == 0,表示维护口
								{
									p16fifo[1] = pRead;		//当前已读指针
									p16fifo[2] = pRead;		//检查指针==读指针,免检省时
									p16fifo[3] = pRead;		//检查指针==读指针,免检省时
									p16fifo[4] = pRead;		//检查指针==读指针,免检省时
									UARTCtrl->RxByte = RxByte;
									UARTCtrl->Protocol = 0;
									UARTCtrl->FrameType = FRAME_TYPE_EDMI;
									UARTCtrl->Task = UART_TASK_RX_DONE;
									return 1;				//返回0没完成,1完成,2超时
								}
								else
								{
									UARTCtrl->Protocol = 1;
									return 0;
								}
							}
							else //错误帧 直接返回
							{
								UARTCtrl->Jump_Flag = 0;
								p16fifo[1] = pRead;		//当前已读指针
								p16fifo[2] = pRead;		//检查指针==读指针,免检省时
								p16fifo[3] = pRead;		//检查指针==读指针,免检省时
								p16fifo[4] = pRead;		//检查指针==读指针,免检省时
								UARTCtrl->RxByte = 0;
								return 0;
							}
						}
					}
				}
			}
		}
		
	}
	p16fifo[1] = pRead;		//当前已读指针
	UARTCtrl->RxByte = RxByte;
	#if((Project/100 == 2) ||(Project/100 == 5))
		if((UARTCtrl->Protocol == 0) && (UARTCtrl->FrameType == FRAME_TYPE_MIXED_645) && (p16timer[0] == 0))
		{	//搜表收到的非法帧
			p16fifo[1] = pRead;
			UARTCtrl->RxByte = RxByte;
			UARTCtrl->Protocol = 0;
			UARTCtrl->Task = UART_TASK_RX_DONE;
			return 2;
		}
	#endif
	if((UARTCtrl->Protocol == 0) && (UARTCtrl->RxByte > 0) && (p16timer[0] == 0))
	{							//超时
		p16fifo[1] = pRead;
		UARTCtrl->RxByte = RxByte;
		UARTCtrl->Protocol = 0;
		UARTCtrl->Task = UART_TASK_RX_TIMEOUT;
		UARTCtrl->FrameType = FRAME_TYPE_UNKNOWN;
		return 2;				//返回0没完成,1完成,2超时
	}
	return 0;					//返回0没完成,1完成,2超时
}


void SetPortTxLed(u32 PORTn)
{
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	switch(PORTn)
	{
		case RS232PORT:
			break;		
		case GPRSPORT:
			pTerminalRam->GPRS_TxLED_MS_Timer = 20;
			break;		
		case RS485_1PORT:
			pTerminalRam->RS485_1_TxLED_MS_Timer = 3;
			break;
		case RS485_2PORT:
			#if ((Project/100)==2)||((Project/100)==3)||((Project/100)==4)||((Project/100)==9)							
					pTerminalRam->RS485_2_TxLED_MS_Timer = 3;			
			#endif
			#if (Project/100)==5   //ybzyl20180601对于II型集中器，2路485的发送灯的毫秒定时器也使用1路485发送灯的毫秒定时器
					pTerminalRam->RS485_1_TxLED_MS_Timer = 3;
			#endif
			break;
		case RS485_3PORT:
			break;		
		case PLC_PORT:
			break;
		case IRPORT:
			break;
		case ENETPORT:
			pTerminalRam->ENETLED_MS_Timer = 3;
			break;
		default:
			break;
	}
}


u16 GetUartPortBpsCtrl(u32 PORTn)
{
	u32 i = 0;	
	RS485PortParaStruct PortPara;
	
	if(PORTn == RS232PORT) return RS232DefaultBPS;

	if(PORTn == IRPORT) return IRDefaultBPS;

	if(PORTn == PLC_PORT) return PLCDefaultBPS;

	if(PORTn == GPRSPORT) return GPRSDefaultBPS;

	if(PORTn == RS485_1PORT)
	{
		i = 0;
	}
	else if(PORTn == RS485_2PORT)
	{
		i = 1;
	}
	else if(PORTn == RS485_3PORT)
	{
		i = 2;
	}
	else 
	{
		return RS485DefaultBPS;
	}

	MC(0, (u32)&PortPara, sizeof(RS485PortParaStruct));
	MR((u32)&PortPara, ADDR_RS485PortParaTbl + (i * sizeof(RS485PortParaStruct)), sizeof(RS485PortParaStruct));
	if((PortPara.Function == UART_FUNC_ATTACH) || (PortPara.Function == UART_FUNC_SLAVE) || 
	   (PortPara.Function == UART_FUNC_UPLINK))
	{
		return ConvertToBpsCtrl(PortPara.BaudRate, PortPara.Parity, PortPara.DataBit, PortPara.StopBit);
	}
	
