gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Uart/TerminalQCSG_Uart_Manage.c
	return RS485DefaultBPS;
}

/****************************************************************************
功     能: 根据输入的串口控制参数得到串口初始化控制字
入口参 数: BaudRateCode: 根据波特率数组，按照下标获取，注意输入参数是南网标准baudrate/300
		   需要先根据南网的取值获得实际波特率，然后转换成王总格式对应的控制字。
		   0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,
		   10=115200,11=230400
		   ParityCode: 0：无校验；1：偶校验；2：奇校验 
		   DataBitCode: 数据位，5,6,7,8
		   StopBitCode: 停止位，0：1位；1：1.5位； 2：2位
返     回: 转换出的王总串口初始化控制字
		   D8-D5位表示波特率,O～11依次表示0=300,1=600,2=1200,3=2400,4=4800,
		   5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400
		   D4位表示停止位位数0/1分别表示1/2个停止位
		   D3位表示有无校验位0/1分别表示无/有
		   D2位表示偶／奇校验位0/1分别表示偶／奇校验
		   D1-D0 数据位数0～3分别表示5-8位
编     写: zhaoyun
编写时 间; 2017-7-10
****************************************************************************/
/*u16 ConvertToBpsCtrl(u8 BaudRateCode, u8 ParityCode, u8 DataBitCode, u8 StopBitCode)
{
	u16 i = 0;
	u16 BspCtrl = 0;
	u32 BaudRate = 0; 
	BaudRate = BaudRateCode;
	BaudRate *= 300;
	for(i = 0; i < MAX_BAUD_NUM; i++)
	{
		if(BaudRate == UartBaudRate[i]) break;
	}
	if(i >= MAX_BAUD_NUM)
	{// 未找到存在的波特率，则默认为2400
		i = 3;			
	}
	BspCtrl |= (i << 5);

	if(StopBitCode == 2)
	{
		BspCtrl |= 0x20;
	}

	if(ParityCode == 0)
	{// 无校验
	
	}
	else if(ParityCode == 2)
	{// 奇校验 
		BspCtrl |= 0xC0;
	}
	else
	{// 偶校验
		BspCtrl |= 0x80;
	}

	if(DataBitCode == 5)
	{
		BspCtrl |= 0x00;
	}
	else if(DataBitCode == 6)
	{
		BspCtrl |= 0x01;
	}
	else if(DataBitCode == 7)
	{
		BspCtrl |= 0x02;
	}
	else
	{
		BspCtrl |= 0x03;
	}
	return BspCtrl;
}
*/













